/*1. 변수란, 메모리블럭에 이름을 지어주는 것과 같은것
상수란, 변하지 않는 객체이다. ex) const 
변수와 상수 모두 초기화 해주는 것이 중요하다

2. 쓰레기값을 입력하면 어떤 일이 일어나는가?
쓰레기값을 입력하면 미정의된 값이 출력된다. 쓰레기값이 잘못나오면 하드웨어에도 영향이 갈수있다. 

3. 식별자 명명 규칙에 대해서 설명해보아라.
1.식별자의 첫 문자엔 알파벳 또는  _ 를 쓸 수 있다. 알파벳은 대소문자를 구별
2.두번째 문자부터는 알파벳,  _ , 숫자 사용가능
3.키워드를 식별자로 쓸 수 없다.(return, int)
만들고자 하는 프로그램 등을 구체적으로 표현하는 이름이 좋다. 

4.타입이란 무엇인가?
컴퓨터에게 어떻게 해석하라고 방법을 가르쳐주는 것을 말한다. int는 정수형으로 해석 등

5. 부호 없는 정수형 변수  val 을 선언해보아라
unsigned val

6.원주율을 기호상수로 표현해보자
#define 원주율 3.14159 <=여기 원주율 한글로 사용해도 되나요?

7.선언과 정의의 차이는 무엇인가?
선언은 컴퓨터한테 이런 이름이 있다고 알려주는것 ex)extant int 
정의는 실제적으로 메모리블록을 사용하는것 */